import React from "react";

import "./styles.sass";

const TermsContainer = () => {
  return (
    <div className="terms-page">
      <div className="container">
        <h1 className="title">Согласие на обработку персональных данных</h1>
        <div className="content">
          <p>
            Согласие на обработку персональных данных Я – Субъект персональных
            данных, во исполнение требований Федерального закона от 27.07.2006
            г. № 152-ФЗ «О персональных данных» свободно, своей волей и в своем
            интересе даю согласие Обществу с ограниченной ответственность
            «Ханилидс» (ИНН 9710082903) на обработку своих персональных данных,
            указанных при регистрации путем заполнения вебформы на сайте.{" "}
          </p>
          <p>
            Под обработкой персональных данных подразумевается сбор,
            систематизацию, накопление, уточнение, обновление, изменение,
            использование, распространение, передачу, обезличивание,
            блокирование, уничтожение, хранение и любые другие действия
            (операции) с персональными данными, которые производятся с
            использованием средств автоматизации и без использования таких
            средств и предусмотрены законодательством РФ.
          </p>
          <p>
            Я согласен(-на) с обработкой персональных данных, осуществляющейся
            для, но не ограничиваясь достижения следующих целей: содействие в
            трудоустройстве с возможностью хранения персональных данных в целях
            рассмотрения моей кандидатуры на вакантные должности третьих лиц.
            Подтверждая данное согласие, я понимаю, что ООО «Ханилидс» и третьи
            лица являются Операторами обработки персональных данных. В связи с
            чем, выражаю свое согласие, в том числе, на информирование меня о
            дате и месте проведения собеседования, на направление мне
            дополнительной информации в соответствии с вышеуказанной целью, в
            том числе иной информации посредством телефонной связи, направления
            мне сообщений через доступные мне программы по обмену мгновенными
            сообщениями.
          </p>
          <p>
            Операторы принимают необходимые правовые, организационные и
            технические меры или обеспечивают их принятие для защиты
            персональных данных от неправомерного или случайного доступа к ним,
            уничтожения, изменения, блокирования, копирования, предоставления,
            распространения персональных данных, а также от иных неправомерных
            действий в отношении персональных данных, а также принимает на себя
            обязательство сохранения конфиденциальности персональных данных{" "}
          </p>
          <p>
            Субъекта персональных данных. Операторы вправе привлекать для
            обработки персональных данных Субъекта персональных данных
            субподрядчиков, а также вправе передавать персональные данные для
            обработки своим аффилированным лицам, обеспечивая при этом принятие
            такими субподрядчиками и аффилированными лицами соответствующих
            обязательств в части конфиденциальности персональных данных.
          </p>
          <p>
            Срок действия настоящего согласия ограничен вышеуказанными целями
            обработки. Я уведомлен(-а), что могу отозвать свое согласие на
            обработку персональных данных и/или на направление мне указанной
            информации, представив письменное заявление, позволяющее достоверно
            установить личность от которого оно исходит и дату получения данного
            заявления. После отзыва согласия на обработку персональных данных,
            Операторы обязуются обеспечить их уничтожение в срок, установленный
            действующим законодательством Российской Федерации.
          </p>
        </div>
      </div>
    </div>
  );
};

export default TermsContainer;
